/*
 * Lab7.c
 *
 * Created: 28.09.2023 15:39:00
 * Author : X3
 */ 
#define F_CPU 1000000UL
#include <avr/io.h>
#include <util/delay.h>

int main(void)
{
	DDRB = 0b11111110;      //8-1 БШУНД 0 - БУНД
	PORTB =  0b00000001;
	
    while (1) 
    {
		if (~PINB & (1<<0))      // ! ~ 0== ме
		{
			PORTB ^= (1<<1);
			_delay_ms(500);
		}
    }
}

// б 0 ахре яеивюя янярнъмхе 1
// мюфюрхе мю 0 ахр декюер ецн янярнъмхе 0
// опнбепхрэ мюкхвхе мскъ б 0 ахре (0 == (PINB & (1<<0)))  
// еякх б 0 ахре 0 рн оепейкчвюел янярнъмхе б 1 ахре (PORTB ^= (1<<1))
// еякх б 0 ахре 1 рн мхвецн ме декюел

/*
(1<<0)   00000001    //ймнойю ме мюфюрю 
		 &
PINB	 00000001
		=
		 00000001    //сякнбхе 0==1 ме хярхмн
		 //ме бундхл б жхйк
		 
		 
 (1<<0)  00000000   //ймнойю мюфюрю
		 &
 PINB	 00000001
		 =
		 00000000   //сякнбхе 0==0 хярхмн
		 //бундхл б жхйк
		 
		 
//оепейкчвемхъ ахрю 
00000001       00000011    (PORTB)
^			   ^
00000010	   00000010    (1<<1)
=			   =
00000011	   00000001

PORTB ^= (1<<N); //оепейкчвюер ахр мю опнрхбнонкнфмне янярнъмхе, цде N мнлеп ахрю
PORTB ^= (1<<N) | (1<<N)
*/